; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	infrared0 - mode
	spectrograph3 - mode
	spectrograph2 - mode
	image4 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 image1)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 infrared0)
	(supports instrument3 image4)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star3)
	(supports instrument6 image4)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 spectrograph3)
	(supports instrument7 image1)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument8 image4)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 GroundStation5)
	(supports instrument10 infrared0)
	(supports instrument10 image1)
	(calibration_target instrument10 Star2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument11 spectrograph2)
	(supports instrument11 infrared0)
	(supports instrument11 image1)
	(calibration_target instrument11 GroundStation4)
	(calibration_target instrument11 Star3)
	(supports instrument12 spectrograph2)
	(supports instrument12 image1)
	(supports instrument12 spectrograph3)
	(calibration_target instrument12 GroundStation5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite2 Planet9)
	(have_image Star6 image4)
	(have_image Star7 spectrograph2)
	(have_image Star8 spectrograph2)
	(have_image Planet9 infrared0)
	(have_image Star10 image1)
	(have_image Star11 spectrograph3)
	(have_image Star12 image1)
	(have_image Phenomenon13 image4)
))

)

; plan
1. (turn_to satellite5 groundstation5 star8)
   deleted: (pointing satellite5 star8)
   added: (pointing satellite5 groundstation5)
   goals met: 0 of 10
2. (switch_on instrument12 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument12)
   goals met: 0 of 10
3. (calibrate satellite5 instrument12 groundstation5)
   added: (calibrated instrument12)
   goals met: 0 of 10
4. (turn_to satellite5 star7 groundstation5)
   deleted: (pointing satellite5 groundstation5)
   added: (pointing satellite5 star7)
   goals met: 0 of 10
5. (take_image satellite5 star7 instrument12 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 1 of 10
6. (turn_to satellite5 star12 star7)
   deleted: (pointing satellite5 star7)
   added: (pointing satellite5 star12)
   goals met: 1 of 10
7. (take_image satellite5 star12 instrument12 image1)
   added: (have_image star12 image1)
   goals met: 2 of 10
8. (turn_to satellite5 star11 star12)
   deleted: (pointing satellite5 star12)
   added: (pointing satellite5 star11)
   goals met: 2 of 10
9. (take_image satellite5 star11 instrument12 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 3 of 10
10. (turn_to satellite5 star10 star11)
   deleted: (pointing satellite5 star11)
   added: (pointing satellite5 star10)
   goals met: 3 of 10
11. (turn_to satellite1 star1 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star1)
   goals met: 3 of 10
12. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 4 of 10
13. (take_image satellite5 star10 instrument12 image1)
   added: (have_image star10 image1)
   goals met: 5 of 10
14. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 5 of 10
15. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 5 of 10
16. (turn_to satellite1 phenomenon13 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon13)
   goals met: 5 of 10
17. (take_image satellite1 phenomenon13 instrument3 image4)
   added: (have_image phenomenon13 image4)
   goals met: 6 of 10
18. (turn_to satellite1 planet9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet9)
   goals met: 6 of 10
19. (take_image satellite1 planet9 instrument3 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 7 of 10
20. (turn_to satellite1 star6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star6)
   goals met: 7 of 10
21. (take_image satellite1 star6 instrument3 image4)
   added: (have_image star6 image4)
   goals met: 8 of 10
22. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 8 of 10
23. (take_image satellite1 star8 instrument3 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 9 of 10
24. (turn_to satellite2 planet9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet9)
   goals met: 10 of 10
